<a href="https://colab.research.google.com/github/mehmetsar/modules_and_packages/blob/main/aggregation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#count fiirst last mean median min max std var sum  basic aggregation funcs

In [ ]:
# group by df.groupby("species").sum() gibi kullanılır

In [1]:
import numpy as np
import pandas as pd

In [8]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [10]:
df1.groupby("Company")["Sales"].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [11]:
df1.groupby("Company")[["Sales"]].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0